cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC_IPR0</name>
      <description>SCS Register Map</description>
      <groupName>SCS</groupName>
      <baseAddress>0xE000E400</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>NVIC_IPRN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_IPRN</displayName>
          <description>IRQ0 ~ IRQ31 Interrupt Priority Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_4n_0</name>
              <description>Priority of IRQ_4n+0\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_1</name>
              <description>Priority of IRQ_4n+1\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_2</name>
              <description>Priority of IRQ_4n+2\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_3</name>
              <description>Priority of IRQ_4n+3\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC_IPR1</name>
      <description>SCS Register Map</description>
      <groupName>SCS</groupName>
      <baseAddress>0xE000E404</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>NVIC_IPRN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_IPRN</displayName>
          <description>IRQ0 ~ IRQ31 Interrupt Priority Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_4n_0</name>
              <description>Priority of IRQ_4n+0\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_1</name>
              <description>Priority of IRQ_4n+1\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_2</name>
              <description>Priority of IRQ_4n+2\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_3</name>
              <description>Priority of IRQ_4n+3\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC_IPR2</name>
      <description>SCS Register Map</description>
      <groupName>SCS</groupName>
      <baseAddress>0xE000E408</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>NVIC_IPRN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>NVIC_IPRN</displayName>
          <description>IRQ0 ~ IRQ31 Interrupt Priority Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRI_4n_0</name>
              <description>Priority of IRQ_4n+0\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_1</name>
              <description>Priority of IRQ_4n+1\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_2</name>
              <description>Priority of IRQ_4n+2\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4n_3</name>
              <description>Priority of IRQ_4n+3\n"0" denotes the highest priority and "15" denotes the lowest priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
