cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register>
          <name>PA_LATCHDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PA_LATCHDAT</displayName>
          <description>PA Interrupt Latch Value</description>
          <addressOffset>0xA4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT0</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT1</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT2</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT3</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT4</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT5</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT6</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT7</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT8</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT9</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT10</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT11</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT12</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT13</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT14</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAT15</name>
              <description>Latch Px.N Interrupt Value\nLatched value of Px.n while the EINT (EINT0~EINT3) selected by GPIO_INTCTL is active.\nNote: \n</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PA_LATCHDAT">
          <name>PB_LATCHDAT</name>
          <displayName>PB_LATCHDAT</displayName>
          <description>PB Interrupt Latch Value</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="PA_LATCHDAT">
          <name>PC_LATCHDAT</name>
          <displayName>PC_LATCHDAT</displayName>
          <description>PC Interrupt Latch Value</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="PA_LATCHDAT">
          <name>PD_LATCHDAT</name>
          <displayName>PD_LATCHDAT</displayName>
          <description>PD Interrupt Latch Value</description>
          <addressOffset>0xB0</addressOffset>
       </register>
