cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register>
          <name>SPIM_RXCLKDLY</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_RXCLKDLY</displayName>
          <description>Rx Clock Delay Control Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLYSEL</name>
              <description>Rx Sample Clock Source Delay Chain Select\n</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Not Delay</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Select sample clock through 2 Delay Cell</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Select sample clock through 4 Delay Cell</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Select sample clock through 6 Delay Cell</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Select sample clock through 14 Delay Cell</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_RX0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_RX0</displayName>
          <description>Data Receive Register 0</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX</name>
              <description>Data Receive Register\nThe Data Receive Registers hold the received data of the last executed transfer. \nNumber of valid RX registers is specified in SPIM_CTL0[BURSTNUM]. If BURSTNUM &gt; 0, received data are held in the most significant RX register first.\nNumber of valid-bit is specified in SPIM_CTL0[DWIDTH]. If DWIDTH is 16, 24, or 32, received data are held in the least significant byte of RX register first.\nIn a byte, received data are held in the most significant bit of RX register first.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX1</name>
          <displayName>SPIM_RX1</displayName>
          <description>Data Receive Register 1</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX2</name>
          <displayName>SPIM_RX2</displayName>
          <description>Data Receive Register 2</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="SPIM_RX0">
          <name>SPIM_RX3</name>
          <displayName>SPIM_RX3</displayName>
          <description>Data Receive Register 3</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register>
          <name>SPIM_TX0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_TX0</displayName>
          <description>Data Transmit Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX</name>
              <description>Data Transmit Register\nThe Data Transmit Registers hold the data to be transmitted in next transfer. \nNumber of valid TX registers is specified in SPIM_CTL0[BURSTNUM]. If BURSTNUM &gt; 0, data are transmitted in the most significant TX register first.\nNumber of valid-bit is specified in SPIM_CTL0[DWIDTH]. If DWIDTH is 16, 24, or 32, data are transmitted in the least significant byte of TX register first.\nIn a byte, data are transmitted in the most significant bit of TX register first.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX1</name>
          <displayName>SPIM_TX1</displayName>
          <description>Data Transmit Register 1</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX2</name>
          <displayName>SPIM_TX2</displayName>
          <description>Data Transmit Register 2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="SPIM_TX0">
          <name>SPIM_TX3</name>
          <displayName>SPIM_TX3</displayName>
          <description>Data Transmit Register 3</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register>
          <name>SPIM_SRAMADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_SRAMADDR</displayName>
          <description>SRAM Memory Address Register</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SRAM Memory Address\nFor DMA Read mode, this is the destination address for DMA transfer.\nFor DMA Write mode, this is the source address for DMA transfer.\nNote: This address must be word-aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_DMATBCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_DMATBCNT</displayName>
          <description>DMA Transfer Byte Count Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>DMA Transfer Byte Count Register\nIt indicates the transfer length for DMA process. \nNote: The unit for counting is byte.\nNote2: The number must be the multiple of 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SPIM_FADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SPIM_FADDR</displayName>
          <description>SPI Flash Address Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SPI Flash Address Register\nFor DMA Read mode, this is the source address for DMA transfer.\nFor DMA Write mode, this is the destination address for DMA transfer.\nNote: This address must be word-aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
