cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPBINTEN</name>
          <displayName>USBD_EPBINTEN</displayName>
          <description>Endpoint B Interrupt Enable Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPBDATCNT</name>
          <displayName>USBD_EPBDATCNT</displayName>
          <description>Endpoint B Data Available Count Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPBRSPCTL</name>
          <displayName>USBD_EPBRSPCTL</displayName>
          <description>Endpoint B Response Control Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPBMPS</name>
          <displayName>USBD_EPBMPS</displayName>
          <description>Endpoint B Maximum Packet Size Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPBTXCNT</name>
          <displayName>USBD_EPBTXCNT</displayName>
          <description>Endpoint B Transfer Count Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPBCFG</name>
          <displayName>USBD_EPBCFG</displayName>
          <description>Endpoint B Configuration Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPBBUFSTART</name>
          <displayName>USBD_EPBBUFSTART</displayName>
          <description>Endpoint B RAM Start Address Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPBBUFEND</name>
          <displayName>USBD_EPBBUFEND</displayName>
          <description>Endpoint B RAM End Address Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPCDAT</name>
          <displayName>USBD_EPCDAT</displayName>
          <description>Endpoint C Data Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPCINTSTS</name>
          <displayName>USBD_EPCINTSTS</displayName>
          <description>Endpoint C Interrupt Status Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPCINTEN</name>
          <displayName>USBD_EPCINTEN</displayName>
          <description>Endpoint C Interrupt Enable Register</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPCDATCNT</name>
          <displayName>USBD_EPCDATCNT</displayName>
          <description>Endpoint C Data Available Count Register</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPCRSPCTL</name>
          <displayName>USBD_EPCRSPCTL</displayName>
          <description>Endpoint C Response Control Register</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPCMPS</name>
          <displayName>USBD_EPCMPS</displayName>
          <description>Endpoint C Maximum Packet Size Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPCTXCNT</name>
          <displayName>USBD_EPCTXCNT</displayName>
          <description>Endpoint C Transfer Count Register</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPCCFG</name>
          <displayName>USBD_EPCCFG</displayName>
          <description>Endpoint C Configuration Register</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPCBUFSTART</name>
          <displayName>USBD_EPCBUFSTART</displayName>
          <description>Endpoint C RAM Start Address Register</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPCBUFEND</name>
          <displayName>USBD_EPCBUFEND</displayName>
          <description>Endpoint C RAM End Address Register</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPDDAT</name>
          <displayName>USBD_EPDDAT</displayName>
          <description>Endpoint D Data Register</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPDINTSTS</name>
          <displayName>USBD_EPDINTSTS</displayName>
          <description>Endpoint D Interrupt Status Register</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPDINTEN</name>
          <displayName>USBD_EPDINTEN</displayName>
          <description>Endpoint D Interrupt Enable Register</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPDDATCNT</name>
          <displayName>USBD_EPDDATCNT</displayName>
          <description>Endpoint D Data Available Count Register</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPDRSPCTL</name>
          <displayName>USBD_EPDRSPCTL</displayName>
          <description>Endpoint D Response Control Register</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPDMPS</name>
          <displayName>USBD_EPDMPS</displayName>
          <description>Endpoint D Maximum Packet Size Register</description>
          <addressOffset>0xF0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPDTXCNT</name>
          <displayName>USBD_EPDTXCNT</displayName>
          <description>Endpoint D Transfer Count Register</description>
          <addressOffset>0xF4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPDCFG</name>
          <displayName>USBD_EPDCFG</displayName>
          <description>Endpoint D Configuration Register</description>
          <addressOffset>0xF8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPDBUFSTART</name>
          <displayName>USBD_EPDBUFSTART</displayName>
          <description>Endpoint D RAM Start Address Register</description>
          <addressOffset>0xFC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPDBUFEND</name>
          <displayName>USBD_EPDBUFEND</displayName>
          <description>Endpoint D RAM End Address Register</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPEDAT</name>
          <displayName>USBD_EPEDAT</displayName>
          <description>Endpoint E Data Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPEINTSTS</name>
          <displayName>USBD_EPEINTSTS</displayName>
          <description>Endpoint E Interrupt Status Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
