cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPEINTEN</name>
          <displayName>USBD_EPEINTEN</displayName>
          <description>Endpoint E Interrupt Enable Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPEDATCNT</name>
          <displayName>USBD_EPEDATCNT</displayName>
          <description>Endpoint E Data Available Count Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPERSPCTL</name>
          <displayName>USBD_EPERSPCTL</displayName>
          <description>Endpoint E Response Control Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPEMPS</name>
          <displayName>USBD_EPEMPS</displayName>
          <description>Endpoint E Maximum Packet Size Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPETXCNT</name>
          <displayName>USBD_EPETXCNT</displayName>
          <description>Endpoint E Transfer Count Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPECFG</name>
          <displayName>USBD_EPECFG</displayName>
          <description>Endpoint E Configuration Register</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPEBUFSTART</name>
          <displayName>USBD_EPEBUFSTART</displayName>
          <description>Endpoint E RAM Start Address Register</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPEBUFEND</name>
          <displayName>USBD_EPEBUFEND</displayName>
          <description>Endpoint E RAM End Address Register</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPFDAT</name>
          <displayName>USBD_EPFDAT</displayName>
          <description>Endpoint F Data Register</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPFINTSTS</name>
          <displayName>USBD_EPFINTSTS</displayName>
          <description>Endpoint F Interrupt Status Register</description>
          <addressOffset>0x130</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPFINTEN</name>
          <displayName>USBD_EPFINTEN</displayName>
          <description>Endpoint F Interrupt Enable Register</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPFDATCNT</name>
          <displayName>USBD_EPFDATCNT</displayName>
          <description>Endpoint F Data Available Count Register</description>
          <addressOffset>0x138</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPFRSPCTL</name>
          <displayName>USBD_EPFRSPCTL</displayName>
          <description>Endpoint F Response Control Register</description>
          <addressOffset>0x13C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPFMPS</name>
          <displayName>USBD_EPFMPS</displayName>
          <description>Endpoint F Maximum Packet Size Register</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPFTXCNT</name>
          <displayName>USBD_EPFTXCNT</displayName>
          <description>Endpoint F Transfer Count Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPFCFG</name>
          <displayName>USBD_EPFCFG</displayName>
          <description>Endpoint F Configuration Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPFBUFSTART</name>
          <displayName>USBD_EPFBUFSTART</displayName>
          <description>Endpoint F RAM Start Address Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPFBUFEND</name>
          <displayName>USBD_EPFBUFEND</displayName>
          <description>Endpoint F RAM End Address Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPGDAT</name>
          <displayName>USBD_EPGDAT</displayName>
          <description>Endpoint G Data Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPGINTSTS</name>
          <displayName>USBD_EPGINTSTS</displayName>
          <description>Endpoint G Interrupt Status Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPGINTEN</name>
          <displayName>USBD_EPGINTEN</displayName>
          <description>Endpoint G Interrupt Enable Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPGDATCNT</name>
          <displayName>USBD_EPGDATCNT</displayName>
          <description>Endpoint G Data Available Count Register</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPGRSPCTL</name>
          <displayName>USBD_EPGRSPCTL</displayName>
          <description>Endpoint G Response Control Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPGMPS</name>
          <displayName>USBD_EPGMPS</displayName>
          <description>Endpoint G Maximum Packet Size Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPGTXCNT</name>
          <displayName>USBD_EPGTXCNT</displayName>
          <description>Endpoint G Transfer Count Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPGCFG</name>
          <displayName>USBD_EPGCFG</displayName>
          <description>Endpoint G Configuration Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPGBUFSTART</name>
          <displayName>USBD_EPGBUFSTART</displayName>
          <description>Endpoint G RAM Start Address Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPGBUFEND</name>
          <displayName>USBD_EPGBUFEND</displayName>
          <description>Endpoint G RAM End Address Register</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPHDAT</name>
          <displayName>USBD_EPHDAT</displayName>
          <description>Endpoint H Data Register</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPHINTSTS</name>
          <displayName>USBD_EPHINTSTS</displayName>
          <description>Endpoint H Interrupt Status Register</description>
          <addressOffset>0x180</addressOffset>
       </register>
