cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPHINTEN</name>
          <displayName>USBD_EPHINTEN</displayName>
          <description>Endpoint H Interrupt Enable Register</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPHDATCNT</name>
          <displayName>USBD_EPHDATCNT</displayName>
          <description>Endpoint H Data Available Count Register</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPHRSPCTL</name>
          <displayName>USBD_EPHRSPCTL</displayName>
          <description>Endpoint H Response Control Register</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPHMPS</name>
          <displayName>USBD_EPHMPS</displayName>
          <description>Endpoint H Maximum Packet Size Register</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPHTXCNT</name>
          <displayName>USBD_EPHTXCNT</displayName>
          <description>Endpoint H Transfer Count Register</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPHCFG</name>
          <displayName>USBD_EPHCFG</displayName>
          <description>Endpoint H Configuration Register</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPHBUFSTART</name>
          <displayName>USBD_EPHBUFSTART</displayName>
          <description>Endpoint H RAM Start Address Register</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPHBUFEND</name>
          <displayName>USBD_EPHBUFEND</displayName>
          <description>Endpoint H RAM End Address Register</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPIDAT</name>
          <displayName>USBD_EPIDAT</displayName>
          <description>Endpoint I Data Register</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPIINTSTS</name>
          <displayName>USBD_EPIINTSTS</displayName>
          <description>Endpoint I Interrupt Status Register</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPIINTEN</name>
          <displayName>USBD_EPIINTEN</displayName>
          <description>Endpoint I Interrupt Enable Register</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPIDATCNT</name>
          <displayName>USBD_EPIDATCNT</displayName>
          <description>Endpoint I Data Available Count Register</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPIRSPCTL</name>
          <displayName>USBD_EPIRSPCTL</displayName>
          <description>Endpoint I Response Control Register</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPIMPS</name>
          <displayName>USBD_EPIMPS</displayName>
          <description>Endpoint I Maximum Packet Size Register</description>
          <addressOffset>0x1B8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPITXCNT</name>
          <displayName>USBD_EPITXCNT</displayName>
          <description>Endpoint I Transfer Count Register</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPICFG</name>
          <displayName>USBD_EPICFG</displayName>
          <description>Endpoint I Configuration Register</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPIBUFSTART</name>
          <displayName>USBD_EPIBUFSTART</displayName>
          <description>Endpoint I RAM Start Address Register</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPIBUFEND</name>
          <displayName>USBD_EPIBUFEND</displayName>
          <description>Endpoint I RAM End Address Register</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPJDAT</name>
          <displayName>USBD_EPJDAT</displayName>
          <description>Endpoint J Data Register</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPJINTSTS</name>
          <displayName>USBD_EPJINTSTS</displayName>
          <description>Endpoint J Interrupt Status Register</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPJINTEN</name>
          <displayName>USBD_EPJINTEN</displayName>
          <description>Endpoint J Interrupt Enable Register</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPJDATCNT</name>
          <displayName>USBD_EPJDATCNT</displayName>
          <description>Endpoint J Data Available Count Register</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPJRSPCTL</name>
          <displayName>USBD_EPJRSPCTL</displayName>
          <description>Endpoint J Response Control Register</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPJMPS</name>
          <displayName>USBD_EPJMPS</displayName>
          <description>Endpoint J Maximum Packet Size Register</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPJTXCNT</name>
          <displayName>USBD_EPJTXCNT</displayName>
          <description>Endpoint J Transfer Count Register</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPJCFG</name>
          <displayName>USBD_EPJCFG</displayName>
          <description>Endpoint J Configuration Register</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPJBUFSTART</name>
          <displayName>USBD_EPJBUFSTART</displayName>
          <description>Endpoint J RAM Start Address Register</description>
          <addressOffset>0x1EC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPJBUFEND</name>
          <displayName>USBD_EPJBUFEND</displayName>
          <description>Endpoint J RAM End Address Register</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPKDAT</name>
          <displayName>USBD_EPKDAT</displayName>
          <description>Endpoint K Data Register</description>
          <addressOffset>0x1F4</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPKINTSTS</name>
          <displayName>USBD_EPKINTSTS</displayName>
          <description>Endpoint K Interrupt Status Register</description>
          <addressOffset>0x1F8</addressOffset>
       </register>
