cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPKINTEN</name>
          <displayName>USBD_EPKINTEN</displayName>
          <description>Endpoint K Interrupt Enable Register</description>
          <addressOffset>0x1FC</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPKDATCNT</name>
          <displayName>USBD_EPKDATCNT</displayName>
          <description>Endpoint K Data Available Count Register</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPKRSPCTL</name>
          <displayName>USBD_EPKRSPCTL</displayName>
          <description>Endpoint K Response Control Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPKMPS</name>
          <displayName>USBD_EPKMPS</displayName>
          <description>Endpoint K Maximum Packet Size Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPKTXCNT</name>
          <displayName>USBD_EPKTXCNT</displayName>
          <description>Endpoint K Transfer Count Register</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPKCFG</name>
          <displayName>USBD_EPKCFG</displayName>
          <description>Endpoint K Configuration Register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPKBUFSTART</name>
          <displayName>USBD_EPKBUFSTART</displayName>
          <description>Endpoint K RAM Start Address Register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPKBUFEND</name>
          <displayName>USBD_EPKBUFEND</displayName>
          <description>Endpoint K RAM End Address Register</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADAT">
          <name>USBD_EPLDAT</name>
          <displayName>USBD_EPLDAT</displayName>
          <description>Endpoint L Data Register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTSTS">
          <name>USBD_EPLINTSTS</name>
          <displayName>USBD_EPLINTSTS</displayName>
          <description>Endpoint L Interrupt Status Register</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAINTEN">
          <name>USBD_EPLINTEN</name>
          <displayName>USBD_EPLINTEN</displayName>
          <description>Endpoint L Interrupt Enable Register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="USBD_EPADATCNT">
          <name>USBD_EPLDATCNT</name>
          <displayName>USBD_EPLDATCNT</displayName>
          <description>Endpoint L Data Available Count Register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="USBD_EPARSPCTL">
          <name>USBD_EPLRSPCTL</name>
          <displayName>USBD_EPLRSPCTL</displayName>
          <description>Endpoint L Response Control Register</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPAMPS">
          <name>USBD_EPLMPS</name>
          <displayName>USBD_EPLMPS</displayName>
          <description>Endpoint L Maximum Packet Size Register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="USBD_EPATXCNT">
          <name>USBD_EPLTXCNT</name>
          <displayName>USBD_EPLTXCNT</displayName>
          <description>Endpoint L Transfer Count Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="USBD_EPACFG">
          <name>USBD_EPLCFG</name>
          <displayName>USBD_EPLCFG</displayName>
          <description>Endpoint L Configuration Register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFSTART">
          <name>USBD_EPLBUFSTART</name>
          <displayName>USBD_EPLBUFSTART</displayName>
          <description>Endpoint L RAM Start Address Register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="USBD_EPABUFEND">
          <name>USBD_EPLBUFEND</name>
          <displayName>USBD_EPLBUFEND</displayName>
          <description>Endpoint L RAM End Address Register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register>
          <name>USBD_UVCHDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_UVCHDAT0</displayName>
          <description>USB Header Word0</description>
          <addressOffset>0x248</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>The first head data(byte 0 was sent first)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>USBD_UVCHDAT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_UVCHDAT1</displayName>
          <description>USB Header Word1</description>
          <addressOffset>0x24C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>The second head data(byte 0 was sent first)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>USBD_UVCHDAT2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_UVCHDAT2</displayName>
          <description>USB Header Word2</description>
          <addressOffset>0x250</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>The third head data(byte 0 was sent first)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>USBD_UVCEPAHCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_UVCEPAHCNT</displayName>
          <description>Endpoint A Header Count</description>
          <addressOffset>0x254</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>This is the header count for the endpoint A~L The header count must be EVEN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
