cmsis-svd/cmsis-svd/data/Nuvoton/NUC505_v1.svd
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPBHCNT</name>
          <displayName>USBD_UVCEPBHCNT</displayName>
          <description>Endpoint B Header Count</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPCHCNT</name>
          <displayName>USBD_UVCEPCHCNT</displayName>
          <description>Endpoint C Header Count</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPDHCNT</name>
          <displayName>USBD_UVCEPDHCNT</displayName>
          <description>Endpoint D Header Count</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPEHCNT</name>
          <displayName>USBD_UVCEPEHCNT</displayName>
          <description>Endpoint E Header Count</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPFHCNT</name>
          <displayName>USBD_UVCEPFHCNT</displayName>
          <description>Endpoint F Header Count</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPGHCNT</name>
          <displayName>USBD_UVCEPGHCNT</displayName>
          <description>Endpoint G Header Count</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPHHCNT</name>
          <displayName>USBD_UVCEPHHCNT</displayName>
          <description>Endpoint H Header Count</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPIHCNT</name>
          <displayName>USBD_UVCEPIHCNT</displayName>
          <description>Endpoint I Header Count</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPJHCNT</name>
          <displayName>USBD_UVCEPJHCNT</displayName>
          <description>Endpoint J Header Count</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPKHCNT</name>
          <displayName>USBD_UVCEPKHCNT</displayName>
          <description>Endpoint K Header Count</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="USBD_UVCEPAHCNT">
          <name>USBD_UVCEPLHCNT</name>
          <displayName>USBD_UVCEPLHCNT</displayName>
          <description>Endpoint L Header Count</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register>
          <name>USBD_DMAADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_DMAADDR</displayName>
          <description>AHB DMA Address Register</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMAADDR\nThe register specifies the address from which the DMA has to read / write. The address must WORD (32-bit) aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>USBD_PHYCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>USBD_PHYCTL</displayName>
          <description>USB PHY Control Register</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000420</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOWPWREN</name>
              <description>PHY Low Power Mode Enable Bit (Low Active)\nUSB PHY HS low power mode configuration control bit.\nWhen this bit is 0, USB PHY is in Low Power Mode and USB PHY TX driver is enable only when USB Device Controller (USBD) transmit the data out to USB bus. In this mode, HS signal quality is not guaranteed.\n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USB PHY Low Power Mode Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USB PHY Low Power Mode Disabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DPPUEN</name>
              <description>DP Pull-up\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pull-up resistor on D+ Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pull-up resistor on D+ Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYEN</name>
              <description>PHY Suspend Enable Bit\n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The USB PHY is suspend</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The USB PHY is not suspend</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKEN</name>
              <description>Wake-up Enable Bit\n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSDET</name>
              <description>VBUS Status\n</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The VBUS is not detected yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The VBUS is detected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
